{"areas":[{"bg":"classroom_broken_wall","examinables":[{"h":0.614019,"script":"pr Professor Coachen broke through here. What a guy","w":0.742523,"x":0.920561,"y":0.07243},{"h":0.268224,"script":"pr That's the door to the hallway. I should go through it.","w":0.275234,"x":0.408879,"y":0.28972}],"mode":0,"name":"Classroom","script":"music deid\nreset_move\nopen_move 1","talks":{}},{"bg":"hallway","examinables":[{"h":0.314285,"script":"pr Live concert. I hope I can do one of those someday...","w":0.194156,"x":1.071429,"y":0.431818}],"mode":0,"name":"Hallway","script":"reset_move\nopen_move 0\nopen_move 3\n\ngotoif i_got_to_hallway end\n\nset i_got_to_hallway 1\nchar quercus normal\nlchar manny normal\nmusic manny\nmc Oh, Quercus! I've been looking all over for you, man.\nqa Manny?\nmc Indeed. I was just wondering if you could sign my paper.\npose querco think\nqa Hmm. Sure, give it to me.\nmc Perfect, thanks.\nmc Alright, I'm going back. See ya.\nlchar none\nmusic none\nqa I should get going too, or I'll be late.\nchar none\nobjection protagonist\nchar querco think\npr Alba-san!!\nmusic querco\npose quercus hand\nqa Stay back, {s}fool! I have a flight to catch!\npr A flight!? Alba-san, you can't go away! Please, stay with me!!!\nqa {s}No! And you have no right to insist, you {s}idiotic buffleton!\npr N-No... But... Why? Why do you have to leave, Alba-san?\npose quercus smug\nqa I am the Ambassador. And the General. I am going to Allebahst. I have matters to attend.\nqa Matters that you have nothing to do with.\nchar none\nmusic none\npr (Dammit!)\nmusic blaise\nwait 0.5\nchar blaise normal\nbl [img=96]res://embed/literallyjustanimageofblaise.png[/img]\nchar none\nmusic none\n\nlabel end\nchar none\nmusic deid","talks":{}},{"bg":"living_room","examinables":[{"h":0.20514,"script":"open_move 4\ngotoif i_ate_twice ate_twice\ngotoif i_ate ate\n\nset i_ate 1\npr chm crch glup slzrp\nreturn\n\nlabel ate\nset i_ate_twice 1\npr again? aight sure im not too full\npr shrt cxurt rup xrulb\nreturn\n\nlabel ate_twice\npr I already ate twice and used improper onomatopoeia. That is quite enough.","w":0.319626,"x":0.950935,"y":0.640187},{"h":0.501869,"script":"pr The custom-made door to my house. It says P for Protagonist. it's pretty fire actually","w":0.282243,"x":0.247664,"y":0.228972}],"mode":0,"name":"Living Room","script":"char none\nmusic protagonist\nreset_move\nopen_move 3\ngotoif !i_ate havent_eaten\nopen_move 4\nlabel havent_eaten\n\nreturnif i_got_home\nset i_got_home 1\npr Here I am... Home.\npr (What a long day, really...)\npr Kinda hungry. I should eat before going to my room.","talks":{}},{"bg":"theatrum","examinables":[],"mode":0,"name":"Theatrum Neutralis","script":"gotoif i_got_to_entrance end\nmusic querco\nchar obama normal\nlchar querco think\nob Mr. Alba? I was, uhh, pretty clear about this.\npose querco smug\nqa You don't understand, Barack. I have important official matters to attend to in Allebahst. Let me go now.\nqa You know, you've been pestering me for a while now, and it seems that that baka Protagonist decided to show his face again.\nqa I really don't need any more of any of this, anyway.\npose obama flushed\nob But... Mr. Alba! You can't... uh... leave!\nobjection querco\npose querco buff\nqa {s}Hubjeckshun! I invoke my [tornado radius=20 freq=4]extraterritorial rights[/tornado]! You cannot hold me now, Barack. I am {s}invincible!\nmusic obama\nobjection obama\npose obama hand\nob I think you're, uhh, forgetting something, Mr, Alba.\nob I have, uh... intraterritorial rights. I am the President of the United States. I still have, uhh, power over you.\nobjection querco\nqa This is Allebahst Academy, {s}fool! Perorate what you want, even you {s}cannot touch me!\nobjection obama\nob No... You just stepped [u]out[/u] of Allebahst Academy, Mr. {s}Alba! This is the United States. You have no extraterritorial rights. You are {s}mine.\npose querco think\nqa What!?\nob Let me be clear, Mr. Alba. Any time you could have had extraterritorial rights, you gave them up by going out.\nob And you can't get out of it without going into the United States, so really, you need my permission, Mr. Alba!\nobjection protagonist\nrchar protagonist point_frustrated\npr Obama-san is right, Alba-san! You can't leave! {s}Please!!!!!!\npr (I can't believe it. I'm on Obama-san's side, even though he's my arch-nemesis...)\nqa Hrgh... No... Have I been bested by these numbskulls...? This just can't be...\nmusic none\nqa But... is that not a valid reason, Barack? Is my job as Ambassador General not a valid reason to leave the premises?\nqa It's an emergency, you know. The country could very well be in danger.\nqa You understand that, right?\nrchar obama normal\nob Oh... Uh... I suppose that is right.\nob I mean, I wouldn't want our official relations to, uh, get any rockier...\nob It has all been pretty bad, uh, really. From what I know.\npose querco buff\nobjection querco\nqa {s}One more word and I {s}throw you across the room! I am leaving.\nlchar none\npr (Dammit... was it really all for nothing?)\nmusic obama\npose obama cry\nob Uh, damn...\nob Ah... hello, uhh, Mr. Protagonist. How... goes it?\npr (I can see a tinge of sadness in his eyes. But I don't feel sorry for him.)\npr (This is [u]war[/u]. I cannot let him have Alba-san, no matter what.)\npr (Seeing him fly away... Honestly, it's still better than him ending up with Mr. Obama and not me.)\nlchar none\n\nlabel end\nset i_got_to_entrance 1\nchar obama cry\nmusic obama\nopen_talk \"What do you want with Alba-san?\"\nopen_talk \"Why are you still here?\"\nopen_move 1","talks":{"What do you want with Alba-san?":"char obama normal\npr What do you want with Alba-san?\npose obama flushed\nob None of, uhh, your business.\npr Why yes, it is exactly my business. Alba-san is mine. I do not want you near him.\npose obama cry\nob ugh...\npr You were the reason he stayed so long, right?\npose obama normal\nob Actually, uhh, I just happened to find him for the second time now. He must have, uh, gotten busy again after before.\nob I guess I was a bit, uh... irrational back there. Mr. Alba had to go to his country for, uh, important reasons.\nob On instinct, I tried to keep him, using my position. But that's... cruel.\nob Letting him go... uhh, that might have been the right decision, in the end.\npr (He's weak. This might not be such a difficult war after all.)\npr (Although... If we ended up hurting Alba-san's feelings...)\npr (...Why is this so difficult to think about...?)\npr Why do you want him, anyway?\nob He's... uh... hot.\npr Only I can say that so back the hell off.\npr 📠 tho\npose obama cry\n\nset i_whatyouwant 1\nreturnif !i_whyyouhere\npr (I've already asked all that I wanted to ask. I should go home now.)\nopen_move 2","Why are you still here?":"char obama normal\npr Obama-san, you're the President of the United States, yeah? Why are you still here at Allebahst Academy? Weren't you just visiting?\nob Well, have you thought about, uhh, the diplomatic purpose of this institution?\npr Diplomatic purpose?\nob I mean, come on, it's, uhh... a college institution situated in an embassy, and it's owned by Allebahst. And we, uh, also have Babahl Academy over there, owned by Babahl. And all of that is in, uh, the United States of America.\nob You know what that means, right?\npr It means... Alba-san is here sometimes.\nob It's not, uh, a regular college at all. The three countries use the building to keep, uh, diplomatic relations between each other.\nob In fact, I oversaw the construction of this place myself.\nob I had, uhh, official meetings here, and so did Mr. Alba.\nob However, as I am the President, I have to stay here, uh, for much longer. I am needed for many occasions.\npr Don't you have the rest of the country to take care of?\nob I, uh... I do, but you underestimate the importance of this building. I have handled, uh, several different matters today.\npr (It was kinda busy today, now that I think of it.)\nob Also, uh, the White House is right nearby, so it's really not much of an issue for me.\nob Mr. Alba, however, uhh, he works here at the embassy, but I heard something's happening in his country. I guess it makes sense that he, uh, had to go to Allebahst, even though each flight can, uh, waste a whole day.\npr I see.\npose obama cry\n\nset i_whyyouhere 1\nreturnif !i_whatyouwant\npr (I've already asked all that I wanted to ask. I should go home now.)\nopen_move 2"}},{"bg":"protagonist","examinables":[{"h":0.314953,"script":"fadeout\nend_investigation","w":0.602337,"x":0.838785,"y":0.232734},{"h":0.46215,"script":"pr thank god I live in the middle of nowhere so I can blast these {s}humongous {s}hungolomghononoloughongous speakers.","w":0.686449,"x":0,"y":0.378505},{"h":0.597664,"script":"pr A collection of my favorite instrument. Guitars are just so cool to be honest.","w":0.471495,"x":1.528505,"y":0}],"mode":0,"name":"Bedroom","script":"char none\nmusic protagonist\npr (I should go to sleep.)\nopen_move 2","talks":{}}],"type":"investigation"}
